In [1]:
# set-up the correct imports
import pandas as pd
from pathlib import Path

In [5]:
# name the file to load to the reader
main_school_csv = Path("C:\\Homework\\pandas-challenge\\PyCitySchools\\Resources\\schools_complete.csv")
main_students_csv = Path("C:\\Homework\\pandas-challenge\\PyCitySchools\\Resources\\schools_complete.csv")

#read the files and store into dataframes
school_file = pd.read_csv(main_school_csv)
student_file = pd.read_csv(main_students_csv)

# combine this data into one dataframe
orignal_school_data = pd.merge(student_file, school_file, how="left", on=["school_name", "school_name"])
orignal_school_data.head()

,School ID_x,school_name,type_x,size_x,budget_x,School ID_y,type_y,size_y,budget_y
0,0,Huang High School,District,2917,1910635,0,District,2917,1910635
1,1,Figueroa High School,District,2949,1884411,1,District,2949,1884411
2,2,Shelton High School,Charter,1761,1056600,2,Charter,1761,1056600
3,3,Hernandez High School,District,4635,3022020,3,District,4635,3022020
4,4,Griffin High School,Charter,1468,917500,4,Charter,1468,917500

In [13]:
#find the total number of unique schools
school_count = len(orignal_school_data["school_name"].unique())
school_count

15